***Pandas***
- Series 
- DataFrame

In [12]:
import pandas as pd
import numpy as np 
series=pd.Series(dtype=object) #future warning if no object is there
data=np.array([1,2,3,4,5,6])
series=pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [13]:
import pandas as pd
   
# Calling DataFrame constructor
df = pd.DataFrame()
print(df)
 
# list of strings
lst = ['Geeks', 'For', 'Geeks', 'is', 
            'portal', 'for', 'Geeks']
   
# Calling DataFrame constructor on list
df = pd.DataFrame(lst)
print(df)

Empty DataFrame
Columns: []
Index: []
        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [30]:
data1={"name":["tom","jack"],"age":[20,21]}
pf=pd.DataFrame(data1)
print(pf)

   name  age
0   tom   20
1  jack   21

***COLOUMN SELECTION***

In [31]:
import pandas as pd
 
# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
 
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
print(df)
print() #newlinw
 
# select two columns
print(df[["Name", 'Age']])

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

     Name  Age
0     Jai   27
1  Princi   24
2  Gaurav   22
3    Anuj   32

***Row selection***
- Pandas provide a unique method to retrieve rows from a Data frame. **DataFrame.loc[ ]** method is used to retrieve rows from Pandas DataFrame. Rows can also be selected by passing integer location to an **iloc[]** function.

In [49]:
import pandas as pd
 
# making data frame from csv file
data = pd.read_csv("/home/arunaadhi/Documents/programs/csvfiles/nba.csv",index_col="Name")
# retrieving row by loc method
first = data.loc["Avery Bradley"]
second = data.iloc[2] #by index
print(first, "\n\n", second,"\n\n")
print(data[["Number","Team","Salary"]])

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object

 Team           Boston Celtics
Number                   30.0
Position                   SG
Age                      27.0
Height                    6-5
Weight                  205.0
College     Boston University
Salary                    NaN
Name: John Holland, dtype: object


               Number            Team     Salary
Name
Avery Bradley     0.0  Boston Celtics  7730337.0
Jae Crowder      99.0  Boston Celtics  6796117.0
John Holland     30.0  Boston Celtics        NaN
R.J. Hunter      28.0  Boston Celtics  1148640.0
Jonas Jerebko     8.0  Boston Celtics  5000000.0
...               ...             ...        ...
Shelvin Mack      8.0       Utah Jazz  2433333.0
Raul Neto        25.0       Utah Jazz   900000.0
Tibor Pleiss     21.0       Utah Jazz  2900000.0
Jeff Withey      24.0       Utah Jazz   947276.0
NaN               NaN             NaN        NaN

[458 rows x 3 columns]

***Selecting a single columns***
In order to select a single column, we simply put the name of the column in-between the brackets

In [51]:
# importing pandas package
import pandas as pd
 
# making data frame from csv file
data = pd.read_csv("/home/arunaadhi/Documents/programs/csvfiles/nba.csv", index_col ="Name")
 
# retrieving columns by indexing operator
first = data["Age"]
 
 
 
print(first)

Name
Avery Bradley    25.0
Jae Crowder      25.0
John Holland     27.0
R.J. Hunter      22.0
Jonas Jerebko    29.0
                 ...
Shelvin Mack     26.0
Raul Neto        24.0
Tibor Pleiss     26.0
Jeff Withey      26.0
NaN               NaN
Name: Age, Length: 458, dtype: float64

***Working with Missing Data***
- Checking for missing values using isnull() and notnull() :
In order to check missing values in Pandas DataFrame, we use a function isnull() and notnull(). Both function help in checking whether a value is NaN or not. These function can also be used in Pandas Series in order to find null values in a series.

In [58]:
# importing pandas as pd
import pandas as pd
 
# importing numpy as np
import numpy as np
 
# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
 
# creating a dataframe from list
df = pd.DataFrame(dict)
 
# using isnull() function  
print(df.notnull()) #both are opposite 
df.isnull()

   First Score  Second Score  Third Score
0         True          True        False
1         True          True         True
2        False          True         True
3         True         False         True

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

***Filling missing values using fillna(), replace() and interpolate()***
- In order to fill null values in a datasets, we use fillna(), replace() and interpolate() function these function replace NaN values with some value of their own. All these function help in filling a null values in datasets of a DataFrame. Interpolate() function is basically used to fill NA values in the dataframe but it uses various interpolation technique to fill the missing values rather than hard-coding the value.

In [67]:
import pandas as pd
 
# importing numpy as np
import numpy as np
 
# dictionary of lists  #np.nan to create a null values
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
 
# creating a dataframe from dictionary
df = pd.DataFrame(dict)
print(df.isnull())
 
# filling missing value using fillna()  
filled=df.fillna(7)
print(df.isnull())  #the original values remain unchanged unless assigning a variable
filled.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False
   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

   First Score  Second Score  Third Score
0        False         False        False
1        False         False        False
2        False         False        False
3        False         False        False

***Dropping missing values using dropna()***
- In order to drop a null values from a dataframe, we used dropna() function this fuction drop Rows/Columns of datasets with Null values in different ways.

In [77]:
# dictionary of lists
dict = {'First Score':[100, 90, np.nan,100],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, 40, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, 65]}
 
# creating a dataframe from dictionary
df = pd.DataFrame(dict)
   
df #no need print function

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3        100.0          56.0           98          65.0

In [78]:
df.dropna() #it clears the entire rows and column

   First Score  Second Score  Third Score  Fourth Score
3        100.0          56.0           98          65.0

***Iterating over rows and columns***

iterating over rows :
In order to iterate over rows, we can use three function **iteritems()**, **iterrows()**, **itertuples()**.hese three function will help in iteration over rows*

In [88]:
# importing pandas as pd
import pandas as pd
  
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
 
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)

print(df)
print()
 
# iterating over rows using iterrows() function 
for i, j in df.items(): #columns
    print(i, j)
    print()
    
for i, j in df.iterrows(): #rows
    print(i, j)
    print()

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

name 0    aparna
1    pankaj
2    sudhir
3     Geeku
Name: name, dtype: object

degree 0       MBA
1       BCA
2    M.Tech
3       MBA
Name: degree, dtype: object

score 0    90
1    40
2    80
3    98
Name: score, dtype: int64

0 name      aparna
degree       MBA
score         90
Name: 0, dtype: object

1 name      pankaj
degree       BCA
score         40
Name: 1, dtype: object

2 name      sudhir
degree    M.Tech
score         80
Name: 2, dtype: object

3 name      Geeku
degree      MBA
score        98
Name: 3, dtype: object

In [90]:
columns=list(df) 
for i in columns:
 
    # printing the third element of the column
    print (df[i][2])

sudhir
M.Tech
80

In [93]:
df.shape #shape rows and column

(4, 3)

In [94]:
df.ndim #dimension

2

In [95]:
df.rank

<bound method NDFrame.rank of      name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98>

In [102]:
import pandas as pd

# Create a DataFrame
df = pd.DataFrame({'A': [2, 1, 3], 'B': [4, 6, 5]})

# Sort the DataFrame by column 'b' in ascending order
df_sorted = df.sort_values(by="B")

print(df_sorted)

   A  B
0  2  4
2  3  5
1  1  6

In [105]:
import pandas as pd

# Create a DataFrame
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})

# Pop the column 'B' from the DataFrame
column_B = df.pop('B')

print(df) 
print()# DataFrame without column 'B'
print(column_B)  # Popped column 'B'

   A  C
0  1  7
1  2  8
2  3  9

0    4
1    5
2    6
Name: B, dtype: int64


The df.where() method in pandas is used to replace values in a DataFrame based on a condition. It returns a new DataFrame with the same shape, where the values that do not meet the condition are replaced with NaN (missing values).

In [108]:
import pandas as pd
import numpy as np

# Create a DataFrame
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

# Use df.where() to replace values based on a condition
condition = df['A'] > 2
new_df = df.where(condition, np.nan)

print(df)       # Original DataFrame
print(new_df)   # Modified DataFrame with values replaced

   A  B
0  1  4
1  2  5
2  3  6
     A    B
0  NaN  NaN
1  NaN  NaN
2  3.0  6.0

Accessing Element from Series with Position

In [109]:
import pandas as pd
import numpy as np
 
# creating simple array
data = np.array(['g','e','e','k','s','f', 'o','r','g','e','e','k','s'])
ser = pd.Series(data)
  
  
#retrieve the first element
print(ser[:5])

0    g
1    e
2    e
3    k
4    s
dtype: object

Indexing a Series using indexing operator [] :
Indexing operator is used to refer to the square brackets following an object. The .loc and .iloc indexers also use the indexing operator to make selections. In this indexing operator to refer to df[ ].

In [125]:
import pandas as pd  
     
# making data frame  
df = pd.read_csv("/home/arunaadhi/Documents/programs/csvfiles/nba.csv")  
   
ser = pd.Series(df['Name']) 
data = ser.head(100)
d=data.dropna() 
data[3:7] 
#d.isnull()

3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
Name: Name, dtype: object

In [126]:
# using .loc[] function
data.loc[3:6]

3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
Name: Name, dtype: object

In [127]:
# using .iloc[] function
data.iloc[3:6]

3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
Name: Name, dtype: object

***Binary Operation on Series***

In [128]:
import pandas as pd  
 
# creating a series
data = pd.Series([5, 2, 3,7], index=['a', 'b', 'c', 'd'])
 
# creating a series
data1 = pd.Series([1, 6, 4, 9], index=['a', 'b', 'd', 'e'])
 
print(data, "\n\n", data1)

a    5
b    2
c    3
d    7
dtype: int64

 a    1
b    6
d    4
e    9
dtype: int64

In [129]:
data.add(data1, fill_value=0)

a     6.0
b     8.0
c     3.0
d    11.0
e     9.0
dtype: float64

In [130]:
# subtracting two series using
# .sub
data.sub(data1, fill_value=0)

a    4.0
b   -4.0
c    3.0
d    3.0
e   -9.0
dtype: float64

***Conversion Operation on Series***
- In order to perform conversion operation we have various function which help in conversion like .astype(), .tolist() etc.

In [140]:
import pandas as pd
import numpy as np

# Create a DataFrame with missing values
data = pd.DataFrame({'A': [1, 2, np.nan], 'B': [4, 4, 6]})
print(data)
# Drop rows with missing values
data.dropna(inplace=True)
print()

print(data)  # DataFrame after dropping rows with missing values
#originally modifies the data in place

     A  B
0  1.0  4
1  2.0  4
2  NaN  6

     A  B
0  1.0  4
1  2.0  4

In [141]:
before = data.dtypes
# converting dtypes using astype 
data["A"]= data["A"].astype(int) 
data["B"]= data["B"].astype(str) 
after=data.dtypes

In [142]:
print("BEFORE CONVERSION\n", before, "\n") 
print("AFTER CONVERSION\n", after, "\n")

BEFORE CONVERSION
 A    float64
B      int64
dtype: object

AFTER CONVERSION
 A     int64
B    object
dtype: object

In [143]:
# converting to list 
salary_list = data["A"].tolist()

In [144]:
# displaying list 
salary_list

[1, 2]

In [146]:
data.mean()

A     1.5
B    22.0
dtype: float64

In [148]:
import pandas as pd

# Create a DataFrame
data = pd.DataFrame({'A': [2, 3, 4], 'B': [5, 6, 7]})

# Perform element-wise exponentiation by 3
result = data.pow(3)

print(result)

    A    B
0   8  125
1  27  216
2  64  343

In [150]:
import pandas as pd

# Create a DataFrame
data = pd.DataFrame({'A': [2, 3, 4], 'B': [5, 6, 7], 'C': [8, 9, 10]})

# Calculate the covariance between columns
covariance = data.cov()
# syntax DataFrame.cov(min_periods=None)

print(covariance)

     A    B    C
A  1.0  1.0  1.0
B  1.0  1.0  1.0
C  1.0  1.0  1.0

In [152]:
# syntax DataFrame.apply(func, axis=0, raw=False, result_type=None, args=(), **kwds)
# series Series.apply(func, convert_dtype=True, args=(), **kwds)

In [153]:
import pandas as pd

# Create a DataFrame
data = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

# Define a custom function to apply
def square(x):
    return x ** 2

# Apply the function to each element of the DataFrame
result = data.apply(square)

print(result)

   A   B
0  1  16
1  4  25
2  9  36

In [154]:
import pandas as pd

# Create a Series
data = pd.Series([1, 2, 3, 4, 5])

# Define a custom function with additional parameters
def multiply_by_n(x, n):
    return x * n

# Apply the function to each element of the Series with additional parameter
result = data.apply(multiply_by_n, args=(3,))

print(result)

0     3
1     6
2     9
3    12
4    15
dtype: int64

Pandas tail() method is used to return bottom n (5 by default) rows of a data frame or series.

In [155]:
import pandas as pd
  
# making data frame
data = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")
  
# calling tail() method 
# storing in new variable
data_bottom = data.tail()
  
# display
data_bottom

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [156]:
import pandas as pd
  
# making data frame
data = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")
  
# calling tail() method 
# storing in new variable
data_bottom = data.tail(n=12)
  
# display
data_bottom

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
446,Derrick Favors,Utah Jazz,15.0,PF,24.0,6-10,265.0,Georgia Tech,12000000.0
447,Rudy Gobert,Utah Jazz,27.0,C,23.0,7-1,245.0,NaN,1175880.0
448,Gordon Hayward,Utah Jazz,20.0,SF,26.0,6-8,226.0,Butler,15409570.0
449,Rodney Hood,Utah Jazz,5.0,SG,23.0,6-8,206.0,Duke,1348440.0
450,Joe Ingles,Utah Jazz,2.0,SF,28.0,6-8,226.0,NaN,2050000.0
451,Chris Johnson,Utah Jazz,23.0,SF,26.0,6-6,206.0,Dayton,981348.0
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

***Pandas DataFrame describe()***

Pandas describe() is used to view some basic statistical details like percentile, mean, std, etc. of a data frame or a series of numeric values. When this method is applied to a series of strings, it returns a different output which is shown in the examples below.

Syntax: DataFrame.describe(percentiles=None, include=None, exclude=None) 

Parameters: 

percentile: 
          list like data type of numbers between 0-1 to return the respective percentile 
include: 
        List of data types to be included while describing dataframe. Default is None 
exclude:           
        List of data types to be Excluded while describing dataframe. Default is None 
Return type:    
        Statistical summary of data frame.

In [159]:
desc = data.describe()
desc

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [164]:
data.dropna(inplace=True)
  
# percentile list
perc = [.20, .40, .60, .80]
  
# list of dtypes to include
include = ['object',"float",'int']
  
# calling describe method
desc = data.describe(percentiles=perc, include=include)
  
# display
desc

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
count,364,364,364.000000,364,364.000000,364,364.000000,364,3.640000e+02
unique,364,30,NaN,5,NaN,17,NaN,115,NaN
top,Avery Bradley,New Orleans Pelicans,NaN,SG,NaN,6-9,NaN,Kentucky,NaN
freq,1,16,NaN,87,NaN,49,NaN,22,NaN
mean,NaN,NaN,16.829670,NaN,26.615385,NaN,219.785714,NaN,4.620311e+06
std,NaN,NaN,14.994162,NaN,4.233591,NaN,24.793099,NaN,5.119716e+06
min,NaN,NaN,0.000000,NaN,19.000000,NaN,161.000000,NaN,5.572200e+04
20%,NaN,NaN,4.000000,NaN,23.000000,NaN,195.000000,NaN,9.472760e+05
40%,NaN,NaN,9.000000,NaN,25.000000,NaN,212.000000,NaN,1.638754e+06
50%,NaN,NaN,12.000000,NaN,26.000000,NaN,220.000000,NaN,2.515440e+06
60%,NaN,NaN,17.000000,NaN,27.000000,NaN,228.000000,NaN,3.429934e+06
80%,NaN,NaN,30.000000,NaN,30.000000,NaN,242.400000,NaN,7.838202e+06
max,NaN,NaN,99.000000,NaN,40.000000,NaN,279.000000,NaN,2.287500e+07

In [165]:
desc = data["Name"].describe()
  
# display
desc

count               364
unique              364
top       Avery Bradley
freq                  1
Name: Name, dtype: object